tsung.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="15000"/>
  </clients>
  <servers>
    <server host="localhost" port="3001" type="tcp"/>
    <server host="localhost" port="3002" type="tcp"/>
    <server host="localhost" port="3003" type="tcp"/>
    <server host="localhost" port="3004" type="tcp"/>
    <server host="localhost" port="3005" type="tcp"/>
  </servers>
  <load>
    <arrivalphase phase="1" duration="20" unit="second">
      <users arrivalrate="2" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="2" duration="20" unit="second">
      <users arrivalrate="4" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="3" duration="20" unit="second">
      <users arrivalrate="6" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="4" duration="20" unit="second">
      <users arrivalrate="8" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="5" duration="20" unit="second">
      <users arrivalrate="10" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="6" duration="20" unit="second">
      <users arrivalrate="12" unit="second"/>
    </arrivalphase>
  </load>
  <options>
    <option name="global_ack_timeout" value="2000"/>
    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>
  <sessions>
    <session name="do-transaction" probability="25" type="ts_http">
      <request>
        <http url="/rydecoin/create_account"
          content_type='application/x-www-form-urlencoded'
          contents='password=1 2 3 4 5&amp;confirmPassword=1 2 3 4 5&amp;op=submit'
          method="POST">
        </http>
      </request>
    </session>
    <session name="do-nothing" probability="75" type="ts_http">
    </session>
  </sessions>
</tsung>